w7d4/app/controllers/api/feeds_controller.rb

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 1]]
---
  def destroy
    feed = Feed.find(params[:id])
    feed.destroy()