w4d3/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 1], ["created_at", "2015-05-12 22:35:26.784637"], ["end_date", "2015-05-28"], ["start_date", "2015-05-26"], ["status", "PENDING"], ["updated_at", "2015-05-12 22:35:26.784637"]]
---
  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    @rental_request.user_id = current_user.id
    if @rental_request.save